package ex_practice;

public class Ex_chapter04_from1_to4 {
	
	// 1. Song 클래스는 노래제목 title 필드, 생성자, getTitle()메소드로 구성한다. : 클래스 만들기 연습
	//	
	
	// 2. 이름(name필드)과 전화번호(tel필드)를 가진 phone 클래스 작성. : 클래스 만들기 연습
	// 이름과 전화번호를 입력받아 2개의 phone 객체를 생성하고 출력하는 메인메소드 작성

	// 3. 사각형을 표현하는 Rect클래스를 활용해서 Rect객체 배열을 생성하고 : 객체 배열 활용
	//		사용자로부터 4개의 사각형을 입력받아 배열에 저장한뒤, 배열을 검색하여 사각형 면적의 합을 출력하는 클래스 작성
	
	// 4. 이름과 전화번호 필드, 생성자 및 필요한 메소드를 가진 phone클래스를 작성 : 2개의 클래스를 만들고 객체 배열 종합 응용
	// 인원수를 입력하고 이름과 전화번호를 모두 입력받은뒤 배열에 저장 > 저장되었습니다 메세지 출력
	// 이름을 검색해서 '검색한이름'의 번호는 '입력받은 전화번호' 입니다 출력
	// 검색한 이름이 없는 이름인경우 없는 이름입니다 출력
	// exit를 입력하면 프로그램을 종료 
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
